#include <iostream>
using namespace std;
//// 삼삼단

/// Q. 정수 n의 값이 주어지면 n*n모양 구구단을 출력하는 프로그램을 작성해보세요.
/*
예제1
입력:
3
출력:
1 * 1 = 1, 1 * 2 = 2, 1 * 3 = 3
2 * 1 = 2, 2 * 2 = 4, 2 * 3 = 6
3 * 1 = 3, 3 * 2 = 6, 3 * 3 = 9

예제2
입력:
4
출력:
1 * 1 = 1, 1 * 2 = 2, 1 * 3 = 3, 1 * 4 = 4
2 * 1 = 2, 2 * 2 = 4, 2 * 3 = 6, 2 * 4 = 8
3 * 1 = 3, 3 * 2 = 6, 3 * 3 = 9, 3 * 4 = 12
4 * 1 = 4, 4 * 2 = 8, 4 * 3 = 12, 4 * 4 = 16
*/
int main() {
    int n; // 1<=n<=9
    cin >> n;

    for(int i=1;i<=n;i++){
        for(int j=1;j<=n;j++) {
            cout << i << " * " << j << " = " << i*j;
            if(j<n) cout << ", ";
        }
        cout << endl;
    }
    return 0;
}