#include <iostream>
using namespace std;

/* Q. 19 * 19 단을 다음 양식에 맞춰 출력하는 코드를 작성해보세요.

1 * 1 = 1 / 1 * 2 = 2 
1 * 3 = 3 / 1 * 4 = 4 
............. 
1 * 17 = 17 / 1 * 18 = 18 
1 * 19 = 19 
2 * 1 = 2 / 2 * 2 = 4 
............. 
19 * 17 = 323 / 19 * 18 = 342 
19 * 19 = 361
*/
int main() {
    
    for(int i=1;i<=19;i++){
        for(int j=1;j<=19;j++){
            cout << i << " * " << j << " = " << i*j;
            if(j%19==0 || j%2==0) cout << endl;
            else cout << " / ";
        }

    }
    return 0;
}